app/Models/Users.php

SELECT *
FROM `users`
WHERE `email` = 'dumbledore@hogwarts.com'
AND `password` = 'd8d3a01ba7e5d44394b6f0a8533f4647'
 LIMIT 1
---
    public function getUser(string $email, string $password)
    {
        return $this->where(['email' => $email])->where(['password' => $password])->first();